#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# (c) @AlbertEinsteinTG

class Translation(object):
    
    START_TEXT = """<b>Hey {}!!</b>
<b>എന്നെ <a href="https://t.me/movie360group" >360 Mᴏᴠɪᴇs</a> ഗ്രൂപ്പിൽ പണി എടുക്കാൻ ഉണ്ടാക്കിയതാ എന്റെ മുതലാളി😘\n\nഅതുകൊണ്ട് നിങ്ങളുടെ ഗ്രൂപ്പിൽ ഉപയോഗിക്കാൻ പറ്റില്ല.....
</b>"""    
    
    HELP_TEXT = """
<b><i>I cant help you</i></b>
"""
    
    ABOUT_TEXT = """<b>➥ Name</b> : <code> Auto Filter Bot</code>
    
<b>➥ Creator</b> : <b><i><a href="https://t.me/genaral7">༒༈ĐΔ€ ŞỮ ØĦ༈༒</a></i></b>
<b>➥ Language</b> : <code>Python3</code>
<b>➥ Library</b> : <i><a href="https://docs.pyrogram.org">Pyrogram Asyncio 1.13.0 </a></i>
<b>➥ Source Code</b> : <i><a href="https://t.me/Movies360help/68">Click Me</a></i>
"""
   
   FORCE_SUBTEXT = """⚠️ 𝑹𝑬𝑨𝑫 𝑻𝑯𝑰𝑺 𝑰𝑵𝑺𝑻𝑹𝑼𝑪𝑻𝑰𝑶𝑵 ⚠️
<i><b>🗣️Hey 👋 Bro</b></i> <i>മല്ലുമൂവിസ് ഗ്രൂപ്പിൽ നിങ്ങൾ ചോദിക്കുന്ന സിനിമകൾ ലഭിക്കണം എന്നുണ്ടെങ്കിൽ നിങ്ങൾ താഴെ കൊടുത്തിട്ടുള്ള ചാനലിൽ ജോയിൻ ചെയ്യണം. ജോയിൻ ചെയിത ശേഷം വീണ്ടും ഇവിടെ വന്ന് <b><a href='{tryagain}'>Try Again</a></b> എന്ന ബട്ടനിൽ അമർത്തി <b>Start</b> അമർത്തിയാൽ നിങ്ങൾക്ക് ഞാൻ ആ സിനിമ അയച്ചു തരുന്നതാണ്..!!</i>😍
🔊In Order To Get The Movie Requested By You in Our Groups, You Will Have To Join Our Official Channel First. After That, Click on the <b><a href='{tryagain}'>Try Again</a></b> Button below. I'll Send You That Movie 🙈
        👇 <b>𝖩𝖮𝖨𝖭 𝖳𝖧𝖨𝖲 𝖢𝖧𝖠𝖭𝖭𝖤𝖫 & 𝖳𝖱𝖸</b> 👇
<b>{invitelink}</b>"""
